import { Card, Text, Button  } from 'components';
import './components/theme.css'

const TestCard = () => {
  return (
    <div style={{ width: '400px', padding: '50px' }}>
      <Card>
        <Text 
          text='ვინმეს ხომ არ გინდათ სიამის კატის კნუტი? ლოკაცია კახეთი. დედა ნაღდი სიამის კატა მამა unknown, ნაღდი კახელი კია ეგ ვიცი დანამდვილებით. შვილი რა გამოვიდა მაგას თქვენც ნაცავთ 2-3 კვირაში 😃😃💜'
        />
        <Text 
          text='ვინმეს ხომ არ გინდათ სიამის კატის კნუტი? ლოკაცია კახეთი. დედა ნაღდი სიამის კატა მამა unknown, ნაღდი კახელი კია ეგ ვიცი დანამდვილებით. შვილი რა გამოვიდა მაგას თქვენც ნაცავთ 2-3 კვირაში 😃😃💜'
        />
        <Text 
          text='ვინმეს ხომ არ გინდათ სიამის კატის კნუტი? ლოკაცია კახეთი. დედა ნაღდი სიამის კატა მამა unknown, ნაღდი კახელი კია ეგ ვიცი დანამდვილებით. შვილი რა გამოვიდა მაგას თქვენც ნაცავთ 2-3 კვირაში 😃😃💜'
        />
        <Text 
          text='ვინმეს ხომ არ გინდათ სიამის კატის კნუტი? ლოკაცია კახეთი. დედა ნაღდი სიამის კატა მამა unknown, ნაღდი კახელი კია ეგ ვიცი დანამდვილებით. შვილი რა გამოვიდა მაგას თქვენც ნაცავთ 2-3 კვირაში 😃😃💜'
        />
      </Card>
      <Card>
        <Text 
          text='ვინმეს ხომ არ გინდათ სიამის კატის კნუტი? ლოკაცია კახეთი. დედა ნაღდი სიამის კატა მამა unknown, ნაღდი კახელი კია ეგ ვიცი დანამდვილებით. შვილი რა გამოვიდა მაგას თქვენც ნაცავთ 2-3 კვირაში 😃😃💜'
        />
        <Button
          text='დადასტურება'
          variant='primary'
        />
        <Button
          text='დადასტურება'
          variant='highlight'
        />
      </Card>
    </div>
  )
}

export default TestCard